{"inkVersion":20,"root":[[{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":["^Вы нашли нас, мы думали, мелкое препятствие остановит вас. Мы <color=#F8FF30>мировые пчёлы</color>. ",{"#":"speaker:Мировые пчёлы"},{"#":"portrait:Black Mage"},"\n","^Мы храним мировую мудрость, и мы выбрали вас, чтобы поделиться знаниями.","\n",{"->":".^.wisdom"},{"wisdom":[["^Какую мудрость вы хотите узнать?","\n","ev","str","^Первую мудрость","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Вторую мудрость","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Последнюю мудрость","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^Мы вот вам одну историю расскажем. Пытался один человек исполнить свою мечту, но считал себя недостаточно готовым, поэтому отложил её исполнение и начал обучаться навыкам. Со временем он осознал, что этих новых навыков недостаточно.","\n","^Он решил продолжить учёбу и ходил к мудрым наставникам. Постепенно он стал всё больше сомневаться в себе и в конце-концов забросил мечту, понял, что не будет к ней готовым никогда.","\n","^Теперь сама <color=#F8FF30>мудрость</color>: воспитайте в себе привычку моментально приступать к выполнению замысла, каким бы сложным он ни был. Иначе вы перегораете, начинаете сомневаться, бояться себя самого.  И чем смелее мечта, тем вернее она превратится в ничто.","\n",{"->":"main.timecamp"},{"#f":5}],"c-1":["\n","^Ещё историю расскажем. Один человек хотел стать лучшим рыцарем в мире и рассказывал об этом всем. Он был хорошим, и все хвалили его, желая удачи в исполнении мечты.","\n","^Но всё оказалось не так хорошо: со временем мальчишка подрос и стал купцом. Однажды он встретил старца, которому в детстве рассказал о своей мечте.","\n","^Старик молвил: \"Ну что, юноша, когда станешь рыцарем?\" \"Не получится, я пропустил этот момент, не знаю, почему так вышло\". \"А я тебе скажу почему, не рассказывавй о своих планах\".","\n","^Каждый раз, рассказывая о плане, ты воплощаешь его в своём внутреннем мире, тратишь силы. И на исполнение плана в реальности уже не хватает сил, потому как в другом мире ты уже реализовал его.","\n",{"->":"main.timecamp"},{"#f":5}],"c-2":["\n","^Мы, мировые пчёлы, знаем мысли друг друга, что делает наши колонии эффективными. Знать мысли собеседника — это необычайный дар, не понимаю, как вы, люди, обходитесь без него.","\n","^Наша главная мудрость в том, чтобы быть искренним. Рассказывайте людям ваши мысли, подарите этот дар и просите взаимности в ответ, узнайте их мысли. Будьте здоровы.","\n",{"->":"main.timecamp"},{"#f":5}]}],{"#f":1}],"timecamp":[["^Вы хотите узнать ещё мудрость или уходите?","\n","ev","str","^Хочу узнать","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Прощайте","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"main.wisdom"},{"#f":5}],"c-1":["^ ",{"#":"exit:0"},"\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}