{"inkVersion":20,"root":[["ev",{"VAR?":"waitForDeath"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"main.bossdeath"},{"->":"0.5"},null]}],[{"->":".^.b"},{"b":["ev",{"VAR?":"wonBossfight"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"main.revelation"},{"->":"0.4.b.5"},null]}],[{"->":".^.b"},{"b":["ev",{"VAR?":"mainVarBoss"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"main.prePurpose"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["ev",{"VAR?":"hasFlusk"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"main"},{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":[{"->":"main.exit"},{"->":".^.^.^.5"},null]}],"nop",{"->":".^.^.^.5"},null]}],"nop",{"->":"0.4.b.5"},null]}],"nop",{"->":"0.5"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":["^Я ждал тебя. Ты пришёл последним за сегодня, уже 16 похожих на тебя \"принцев\" погибли пытаясь пройти через меня. Я преграждаю путь источнику воды, который тебе так нужен.","\n","ev",true,"/ev",{"VAR=":"mainVarBoss","re":true},{"->":".^.purpose"},{"purpose":["^Чтобы пройти дальше, тебе нужно сразиться со мной и победить. Вот так всё просто, как сражаться ты уже знаешь.","\n","end",{"#f":1}],"prePurpose":[["^Принц, ты пока не одолел меня. Хочешь я поддамся хи-хи ?!, или хочешь подсказку ?","\n","ev","str","^Нужна подсказка","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Нет, до свидания","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ПРОЙТИ ИСПЫТАНИЕ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"main.purpose"},{"#f":5}],"c-1":["\n","end",{"#f":5}],"c-2":["^ ",{"#":"start:bossfight"},"\n","end",{"#f":5}]}],{"#f":1}],"exit":["^Рыцарь тебе рано приходить ко мне. Раздобудь флягу скрытую в клетке за 3-мя замками. Подробнее узнать ты можешь у того, который это... я забыл его имя. В общем он с белой головой, хранитель леса.","\n","end",{"#f":1}],"revelation":[["^Неужели я был побеждён тобой ?! Какое жалкое зрелище, я — великий Курут проиграл.","\n","^Но я с гордостью приму поражение, уже сотню лет я убивал бравых рыцарей, которые приходили получить у меня последний ключ.","\n","^Моё испытание смертельно опасно, но каким-то образом тебе удалось избежать смерти.","\n","^Тогда моё дело окончено, наконец-то моя цель выполнена. Теперь могу я попросить у тебя выполнить мою последнюю просьбу ?","\n","ev","str","^Да, конечно","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Спасибо что согласился, не зная что я попрошу. Всё же ты победил меня не случайно благородный воин.","\n","^Итак моя просьба — убей меня принц, я был создан для того чтобы охранять ключ и убивать недостойных. Как только ты победил меня, надобность в моём существовании отпала. И я хочу чтобы только ты — достойнейший положил конец моей жизни. Ты окажешь мне эту услугу ?","\n","ev","str","^Ты же можешь найти себе другую цель, зачем умирать ?","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Вы люди забавные, хи-хи. До тебя один рыцарь пытался задобрить меня едой, другой просто вежливо попросил ему дать ключ, а третий спорил.","\n","^Дескать, умение сражаться не главное, важно благородство и ум, но он забыл что у меня проходят испытание силы, только сильный пройдёт его.","\n","^Испытания благородства и ума проходить нужно у других. В общем к чему я это ?!","\n","^Вспомнил, вы люди до жути забавные. Может вам легко менять предназначение своё, или вовсе существовать без него.","\n","^А я не такой, меня создали с единственной целью, быть стражем испытания силы. Я не могу поменять своё предназначение, такой силой обладает лишь мой создатель.","\n","^Было бы оскорблением, если бы я решился перечить его воле. Поэтому выполни мою просьбу, убей меня и наполни водой эту чёртову бутылку наконец. Дальше ты сам знаешь, спасибо.","\n","ev",true,"/ev",{"VAR=":"waitForDeath","re":true},"end",{"#f":5}]}],{"#f":1}],"bossdeath":["^Чего же ты ждёшь, убей меня прошу, иначе ты не пройдёшь через меня.","\n","end",{"#f":1}],"#f":1}],"global decl":["ev",false,{"VAR=":"mainVarBoss"},false,{"VAR=":"waitForDeath"},false,{"VAR=":"hasFlusk"},false,{"VAR=":"wonBossfight"},"/ev","end",null],"#f":1}],"listDefs":{}}