INCLUDE globals.ink
->main

=== main ===
Тьма пробила брешь в барьере, и добралась до реки, и заблокировала течение реки. Помоги развеять тьму и открыть путь для воды. #speaker:Эйлин #portrait:Princess
Сейчас около речки стоит волшебник, с его помощью ты сможешь развеять тьму. Только не обращай внимание на их манеры общения, у старых волшебников свои причуды.
Кем они являются на самом деле загадка для меня, но они заслуживают доверия.
Мне кажется они воплощения этого волшебного места и цветок сам их создал, чтобы испытывать людей, проникать в их душу. И недостойный будет выгнан из этого места.
->END