INCLUDE globals.ink
->main

=== main ===
Неужели это ты принц?! Я успела высвободить свой дух из тела, я помогу тебе выполнить испытания.
Этот цветок поможет разбудить меня, но я думаю тебе уже сказал об этом волшебник.
Злодей Торгат воспользовался нестабильностью в королевстве, и напал с полчищей тёмных чудищ.
Он хочет завладеть цветком, но он не знал что мы заранее спрятали его в этом лесу, но из-за этого волшебная сила цветка начала увядать. 
Этот цветок "спящая принцесса" может исполнять желания, Торгат хочет воскресить свою любимую, чтобы вместе с ней править нашим королевством
->END