INCLUDE globals.ink
->main

=== main ===
Неужели это ты принц?! Я успела высвободить свой дух из тела, я помогу тебе получить цветок. #speaker:Эйлин #portrait:Princess
Этот цветок сможет разбудить меня, но я думаю тебе уже сказал об этом волшебник.
Злодей Торгат воспользовался нестабильностью в королевстве, и сломал печать, которая сдерживала тьму.
Он хочет завладеть цветком, но мы заранее защитили лес дополнительным барьером от тьмы, поэтому какое-то время у нас есть.
Этот цветок "спящая принцесса" может исполнять желания, Торгат хочет воскресить свою любимую. Но он не знает о том, каким образом этот цветок исполняет желания — он исполняет их в самом жутком варианте, о котором ты даже не задумываешься.
->END