INCLUDE globals.ink
->main

=== main ===
Тьма добралась даже до реки, она перестала течь из-за тьмы, которая преграждает ей путь. Помоги развеять тьму и открыть путь для воды.
Сейчас около речки стоит волшебник, с его помощью ты сможешь развеять тьму. Они всё время, как себя помню охраняют это место.
Кем они являются на самом деле загадка для меня, но они заслуживают доверия. 
Мне кажется они воплощения этого волшебного места и цветок сам их создал, чтобы испытывать людей, проникать в их душу. И недостойный будет выгнан из этого места.
->END