INCLUDE globals.ink
->main

=== main ===
Тьма пробила брешь в барьере, добралась до реки и заблокировала её течение. Помоги развеять тьму и открыть путь для воды. #speaker:Эйлин #portrait:Princess
Сейчас около речки стоит волшебник; с его помощью ты сможешь развеять тьму. Только не обращай внимание на его манеры общения: у старых волшебников свои причуды.
Кем они являются на самом деле — загадка для меня, но они заслуживают доверия.
Мне кажется, они — воплощения этого волшебного места, будто сам цветок их создал, чтобы испытывать людей, проникать в их душу. И недостойный будет выгнан из этого места.
->END