//Этот диалог предназначен для старта
->start

=== start ===
На замок напали, <color=\#F8FF30><b>прицесса в опасности</b></color>, скоро тьма поглотит всё королевство. Зов о помощи был послан.  #speaker:Рассказчик #portrait:Black Mage 
Наш принц хочет помочь спасти королевство, он собрал отряд на помощь. По дороге на них напали, наш герой остался один. Неужели ему придётся разбираться со всем самом?! 
Говорят: "Даже один человек, способен изменить ход будущего." Знали бы они, что этот человек должен быть влюблён, без любви не изменишь будущее.
->END